---
kind: type
id: T:Autodesk.Revit.DB.RepeaterBounds
source: html/99c1ffdf-818b-1918-a6ba-42b7904ca4bc.htm
---
# Autodesk.Revit.DB.RepeaterBounds

Represents bounds of the array of repeating references in 0, 1, or 2 dimensions.
 (See RepeatingReferenceSource ).

## Syntax (C#)
```csharp
public class RepeaterBounds : IDisposable
```